УТ_для_edt/src/Catalogs/смартСтатусыRoistat/смартСтатусыRoistat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартСтатусыRoistat</name>
  <comment>#Б-1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов</comment>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.смартТипыСтатусовRoistat</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СостоянияИнтересовИУсловия</name>
    <attributes>
      <name>СостояниеИнтереса</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольОплаты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолнаяОплата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартСтатусыRoistat/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Проверка уникальности состояний и условий
	Если СостоянияИнтересовИУсловия.Количество() > 0 Тогда
		
		ТЗСостоянияИнтересовИУсловия = СостоянияИнтересовИУсловия.Выгрузить();
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТЗ", ТЗСостоянияИнтересовИУсловия);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		    |	ТЗ.СостояниеИнтереса КАК СостояниеИнтереса,
			|	ТЗ.КонтрольОплаты КАК КонтрольОплаты,
			|	ТЗ.ПолнаяОплата КАК ПолнаяОплата
			|ПОМЕСТИТЬ ВТ_СостоянияИнтересовИУсловия
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.смартСтатусыRoistat.СостоянияИнтересовИУсловия
			|ГДЕ
			|	Ссылка <> &Ссылка
			|	И НЕ Ссылка.ПометкаУдаления
			|	И (СостояниеИнтереса, КонтрольОплаты, ПолнаяОплата) 
			|	   	  В(ВЫБРАТЬ СостояниеИнтереса, КонтрольОплаты, ПолнаяОплата 
			|		 	ИЗ ВТ_СостоянияИнтересовИУсловия)";
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаРезультата = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаРезультата.Следующий() Цикл
				
				ТекстСообщения = НСтр("ru = 'Данные условия участвуют в табличной части другого состояния: '") 
								 + СокрЛП(ВыборкаРезультата.Ссылка);
								 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
